SA-0AOA/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       457792;
    }
    outlet
    {
        type            patch;
        nFaces          512;
        startFace       457792;
    }
    front
    {
        type            empty;
        nFaces          229376;
        startFace       458304;
    }
    back
    {
        type            empty;
        nFaces          229376;
        startFace       687680;
    }
    aerofoil
    {
        type            wall;
        nFaces          512;
        startFace       917056;
    }
    farfield
    {
        type            patch;
        nFaces          896;
        startFace       917568;
    }
)

// ************************************************************************* //
