SA-0AOA/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (52.05 0 0);

boundaryField
{
    farfield
    {
        type                      fixedValue;
        value              uniform (52.05 0 0);
    }

    outlet
    {
        type                      zeroGradient;
       
        
    }
    aerofoil
    {
        type            noSlip;
       
    }
    
    defaultFaces
    {
       type            empty;
    }
     
    front
    {
       type            empty;
    }
     
    back
    {
       type            empty;
    }
   
}

// ************************************************************************* //
