SA-0AOA/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform  0.307239855e-5;
//internalField    calculated;

boundaryField
{
    farfield
    {
        type                     calculated;
        value           uniform  0.307239855e-5;
    }

    outlet
    {
        type                      calculated;
        value           uniform  0.307239855e-5;
    }
    
    aerofoil
    {
        type            nutUSpaldingWallFunction;
        value           uniform  0;
    }
    defaultFaces
    {
       type            empty;
    }
     
    front
    {
       type            empty;
    }
     
    back
    {
       type            empty;
    }
   
    
   
}

// ************************************************************************* //
